blog/misu.org
# -*- org-html-htmlize-output-type: nil; org-html-postamble: nil; -*-

#+HTML_HEAD_EXTRA: <style>.meta { opacity: 0.75; margin-left: 1em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; padding: 0em 1em; margin-left: 1em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head { cursor: pointer; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head > p:first-child { font-variant: small-caps; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-body { max-height: 0em; transform: scaleY(0); transition: transform 0.3s; transform-origin: top; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-body > p:first-child { margin-top: 0; padding-top: 0.5em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head > p:last-child { margin-bottom: 0; padding-bottom: 0.5em; }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-body:hover { max-height: 10000em; transform: scaleY(1); }</style>
#+HTML_HEAD_EXTRA: <style>.accordion-head:hover + .accordion-body { max-height: 10000em; transform: scaleY(1); }</style>
#+HTML_HEAD_EXTRA: <style>.trigger { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; padding: 0.5em 1em; margin-left: 1em; }</style>
#+HTML_HEAD_EXTRA: <style>.trigger:before { content: 'Trigger'; font-variant: small-caps; }</style>

* Prior knowledge

You may have heard of "the billion dollar mistake". This is the name Tony Hoare gives to his introduction of the null reference in ALGOL. If you've ever experienced a ~NullPointerException~ or a ~Cannot read property of null~, you're a victim of this mistake.

You may also have heard of admonitions against stringly typed programming. If you've ever written code like ~$('#foo')~ or ~el.append('<div>Hello</div>')~, you've been party to jQuery-induced stringly typed programming.

The problem common to both is that we're permitted to pass around nonsensical data that we have no hope of handling---~null~'s that we can't ~render()~ and ~<div <table>>~ that can't be given an interpretation in the DOM. That is, we've made it possible---easy---to represent illegal states.

* Make illegal state unrepresentable

Instead, we should seek to make illegal state unrepresentable. That is, for each type, our ideal is that it simply /can't/ be used to describe things that are uninteresting or impossible by our business logic. Let's look at a few short examples to prime our intuition then try to make our slogan more precise.

#+begin_src js
/* If we want to track course progress, we might be tempted to do something like: */
type CourseCompletionStateBad = string;

/* But this permits an infinite (up to hardware limits) number of course states. Perhaps all we really need is: */
type CourseCompletionStateGood = 'Unstarted' | 'Started' | 'Complete';

/* Imagine we want to talk about essay assignments: */
type AssignmentBad = {
  prompt: string,
  dueOn: string,
};
/* We'd do better with: */
type AssignmentGood = {
  prompt: string,
  dueOn: Date,
};
/* Now it's impossible to be `dueOn: 'yellow'`. */
#+end_src

Don't worry too much about the details yet. As long the direction I'm gesturing in is now clear, we're ready to move on.

#+begin_meta
Any time you see a paragraph like this, it denotes meta content---some description of the underlying thinking or why ideas are presented as they are. The hope is that they predict and alleviate frustrations. If they don't, feel free to skip them.
#+end_meta

#+begin_meta
Now's as good a time as any to address what will be an ongoing tension in the series. Strong evidence suggests that cognitive load impairs learning and that "more realistic" scenarios impose more cognitive load. This suggests that we should present examples which are minimal and isolated, focusing solely on the core technique. However, this creates the danger of examples which seem pointless and rarefied. Research confirms that motivation is /also/ import for learning outcomes. So the way I'll attempt to navigate this tension is by generally presenting simple unconvincing examples first before graduating to more difficult---but more realistic and motivating---examples.
#+end_meta

* Goals

- Learn what the slogan "make illegal state unrepresentable" means
  - You'll know you're on your way when you feel comfortable recalling the meaning of the slogan and can bring examples to mind
  - Check this goal off when you can generate and apply novel ways of making illegal state unrepresentable
- Learn some techniques for making illegal state unrepresentable
  - You'll know you're on our way when you can complete the accompanying exercises
  - Check this goal off when you're regularly applying these techniques in your day-to-day code

