blog/misu.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-06 Fri 10:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eric Easley" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc0dd6bf">1. Prior knowledge</a></li>
<li><a href="#orgd686809">2. Make illegal state unrepresentable</a></li>
<li><a href="#org664303c">3. Goals</a></li>
<li><a href="#orgdf30fbc">4. A rigorous interlude</a></li>
<li><a href="#orged4132e">5. How</a>
<ul>
<li><a href="#org938b8b7">5.1. Enums</a></li>
<li><a href="#orgee63b64">5.2. Disjoint unions</a></li>
<li><a href="#org667cf01">5.3. Refined types</a></li>
</ul>
</li>
<li><a href="#orgc002741">6. Why</a>
<ul>
<li><a href="#org3e6e993">6.1. Code quality</a></li>
<li><a href="#org45cc70d">6.2. Cognitive science</a></li>
</ul>
</li>
<li><a href="#orgaad6419">7. Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc0dd6bf" class="outline-2">
<h2 id="orgc0dd6bf"><span class="section-number-2">1</span> Prior knowledge</h2>
<div class="outline-text-2" id="text-1">
<p>
You may have heard of "the billion dollar mistake". This is the name Tony Hoare gives to his introduction of the null reference in ALGOL. If you've ever experienced a <code>NullPointerException</code> or a <code>Cannot read property of null</code>, you're a victim of this mistake.
</p>

<p>
You may also have heard of admonitions against stringly typed programming. If you've ever written code like <code>$('#foo')</code> or <code>el.append('&lt;div&gt;Hello&lt;/div&gt;')</code>, you've been party to jQuery-induced stringly typed programming.
</p>

<p>
The problem common to both is that we're permitted to pass around nonsensical data that we have no hope of handling---<code>null</code>'s that we can't <code>render()</code> and <code>&lt;div &lt;table&gt;&gt;</code> that can't be given an interpretation in the DOM. That is, we've made it possible&#x2014;easy&#x2014;to represent illegal states.
</p>
</div>
</div>

<div id="outline-container-orgd686809" class="outline-2">
<h2 id="orgd686809"><span class="section-number-2">2</span> Make illegal state unrepresentable</h2>
<div class="outline-text-2" id="text-2">
<p>
Instead, we should seek to make illegal state unrepresentable. That is, for each type, our ideal is that it simply <i>can't</i> be used to describe things that are uninteresting or impossible by our business logic. Let's look at a few short examples to prime our intuition then try to make our slogan more precise.
</p>

<div class="org-src-container">
<pre><code class="src src-js">/* If we want to track course progress, we might be tempted to do something like: */
type CourseCompletionStateBad = string;

/* But this permits an infinite (up to hardware limits) number of course states. Perhaps all we really need is: */
type CourseCompletionStateGood = 'Unstarted' | 'Started' | 'Complete';

/* Imagine we want to talk about essay assignments: */
type AssignmentBad = {
  prompt: string,
  dueOn: string,
};
/* We'd do better with: */
type AssignmentGood = {
  prompt: string,
  dueOn: Date,
};
/* Now it's impossible to be `dueOn: 'yellow'`. */
</code></pre>
</div>

<p>
Don't worry too much about the details yet. As long the direction I'm gesturing in is now clear, we're ready to move on.
</p>

<div class="meta">
<p>
Any time you see a paragraph like this, it denotes meta content&#x2014;some description of the underlying thinking or why ideas are presented as they are. The hope is that they predict and alleviate frustrations. If they don't, feel free to skip them.
</p>

</div>

<div class="meta">
<p>
Now's as good a time as any to address what will be an ongoing tension in the series. Strong evidence suggests that cognitive load impairs learning and that "more realistic" scenarios impose more cognitive load. This suggests that we should present examples which are minimal and isolated, focusing solely on the core technique. However, this creates the danger of examples which seem pointless and rarefied. Research confirms that motivation is <i>also</i> import for learning outcomes. So the way I'll attempt to navigate this tension is by generally presenting simple unconvincing examples first before graduating to more difficult&#x2014;but more realistic and motivating&#x2014;examples.
</p>

</div>
</div>
</div>

<div id="outline-container-org664303c" class="outline-2">
<h2 id="org664303c"><span class="section-number-2">3</span> Goals</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Learn what the slogan "make illegal state unrepresentable" means
<ul class="org-ul">
<li>You'll know you're on your way when you feel comfortable recalling the meaning of the slogan and can bring examples to mind</li>
<li>Check this goal off when you can generate and apply novel ways of making illegal state unrepresentable</li>
</ul></li>
<li>Learn some techniques for making illegal state unrepresentable
<ul class="org-ul">
<li>You'll know you're on our way when you can complete the accompanying exercises</li>
<li>Check this goal off when you're regularly applying these techniques in your day-to-day code</li>
</ul></li>
</ul>
</div>
</div>
