blog/misu.org
* A rigorous interlude

(Feel free to skip this section if it doesn't excite you. It's mathy but may assure some that this slogan isn't all hand-waving.)

Our next step is to try to make the notion of a type's size more precise. Each type delimits a number of valid inhabitants. ~boolean~ has the two inhabitants ~true~ and ~false~. ~Natural~ has the inhabitants ~0~, ~1~, ~2~, ~3~, and so on.

#+begin_meta
Certain blocks will be highlighted and annotated like this so that they're easier to scan for.

Hover over a practice block to see the answer.
#+end_meta

#+begin_accordion
#+begin_accordion-head
Practice

How many inhabitants are in ~?boolean~?
#+end_accordion-head
#+begin_accordion-body
4 (~?~ allows ~null~ /and/ ~undefined~.)
#+end_accordion-body
#+end_accordion

The cardinality of primitive types like this is usually pretty intuitive, but how do we build to more complex types? There are two basic building blocks from which we'll build more complex types out of primitive types.

The first is the union operation for types---~|~ in ~flow~. When we encounter this (as long as the types on either side are disjoint: https://flow.org/en/docs/types/unions/#toc-disjoint-unions), the total number of inhabitants is the sum of the number of inhabitants of the left hand type and the number of inhabitants of the right hand type. This is why union types are also sometimes called sum types. In symbols rather than words, where ~τ~ and ~φ~ are types and ~σ(τ)~ represents the cardinality of type ~τ~:

#+begin_src
σ(τ | φ) = σ(τ) + σ(φ)

We can start to convince ourselves it's true with examples like:

type boolean = true | false
σ(true) = 1 \text{(This is why types like these are called singleton types.)}
σ(false) = 1
σ(boolean) = σ(true | false) = σ(true) + σ(false) = 1 + 1

type ?boolean = boolean | null | void
σ(null) = 1
σ(void) = 1
σ(?boolean) = σ(boolean | null | void) = σ(boolean) + σ(null) + σ(void) = 2 + 1 + 1
#+end_src

#+begin_accordion
#+begin_accordion-head
Practice

List out all the inhabitants of ~?boolean~. Does it agree with our answer?

Derive the cardinality for ~type CourseCompletionStateGood = 'Unstarted' | 'Started' | 'Complete'~.
#+end_accordion-head
#+begin_accordion-body
#+begin_src js
type ?boolean = true | false | null | undefined;
σ(CourseCompletionStateGood) = σ('Unstarted') | σ('Started') | σ('Completed') = 1 + 1 + 1
#+end_src
#+end_accordion-body
#+end_accordion

The other major building block for complex types is what we use when we build records and tuples (A tuple of ~number~ and ~boolean~ looks like ~[number, boolean]~ in ~flow~.). In a tuple, the total number of inhabitants of the tuple is the product of the number of inhabitants of each side (hence, these are sometimes called product types). In symbols:

#+begin_src
σ([τ, φ]) = σ(τ) · σ(φ)

We can start to convince ourselves it's true with examples like:

σ([Void, ?boolean])
  = σ(Void) · σ(?boolean)
  = 1 · 4
σ({ loggedIn: boolean, firstLogin: ?boolean })
  = σ({ loggedIn: boolean }) · σ({ firstLogin: ?boolean })
  = σ(boolean) · σ(?boolean)
  = 2 · 4
#+end_src

#+begin_accordion
#+begin_accordion-head
Practice

List out all the inhabitants of ~{ loggedIn: boolean, firstLogin: ?boolean }~. Does it agree with our answer?
#+end_accordion-head
#+begin_accordion-body
#+begin_src js
type { loggedIn: boolean, firstLogin: ?boolean } =
  { loggedIn: true, firstLogin: true } |
  { loggedIn: true, firstLogin: false } |
  { loggedIn: true, firstLogin: null } |
  { loggedIn: true, firstLogin: undefined } |
  { loggedIn: false, firstLogin: true } |
  { loggedIn: false, firstLogin: false } |
  { loggedIn: false, firstLogin: null } |
  { loggedIn: false, firstLogin: undefined };
The 8 we see here agrees with our calculated answer.
#+end_src
#+end_accordion-body
#+end_accordion

These two building blocks are enough to build enormously complex types---lists, maps, enums, etc.

Our next step is to make the concept of illegal state a bit more precise. We can take either an operational or semantic perspective. The operational perspective says that an illegal state is one which is never occupied during any execution trace of the properly-functioning software. (This is less question-begging than it sounds because we define proper functioning of the software in terms of inputs and outputs while states can be purely internal.) The semantic perspective says that an illegal state is one which cannot be given a coherent meaning in the underlying domain that our software represents. In either case, we'll represent these valid states of ~τ~ as ~{τ | β(τ)}~ where ~β~ defines validity according to our business logic. (There's a notational collision here: ~|~ for union in ~flow~ and ~|~ for "such that" in set-builder notation. We can disambiguate by noting that set builder ~|~ is always and only enclosed by ~{}~ rather than ~()~.)

With this machinery, we can rephrase. Instead of "make illegal state unrepresentable", we can say "use the business-logic-compatible type with minimum cardinality". Or equivalently for a fixed business logic, maximize ~σ({τ | β(τ)}) / σ(τ)~. A value of ~1~ represents perfection with no illegal states remaining in the type.

* How

There are a variety of standard tricks for making illegal state unrepresentable that it will be useful to have in our bag.

