blog/misu.html

<div id="outline-container-orgdf30fbc" class="outline-2">
<h2 id="orgdf30fbc"><span class="section-number-2">4</span> A rigorous interlude</h2>
<div class="outline-text-2" id="text-4">
<p>
(Feel free to skip this section if it doesn't excite you. It's mathy but may assure some that this slogan isn't all hand-waving.)
</p>

<p>
Our next step is to try to make the notion of a type's size more precise. Each type delimits a number of valid inhabitants. <code>boolean</code> has the two inhabitants <code>true</code> and <code>false</code>. <code>Natural</code> has the inhabitants <code>0</code>, <code>1</code>, <code>2</code>, <code>3</code>, and so on.
</p>

<div class="meta">
<p>
Certain blocks will be highlighted and annotated like this so that they're easier to scan for.
</p>

<p>
Hover over a practice block to see the answer.
</p>

</div>

<div class="accordion">
<div class="accordion-head">
<p>
Practice
</p>

<p>
How many inhabitants are in <code>?boolean</code>?
</p>

</div>
<div class="accordion-body">
<p>
4 (<code>?</code> allows <code>null</code> <i>and</i> <code>undefined</code>.)
</p>

</div>

</div>

<p>
The cardinality of primitive types like this is usually pretty intuitive, but how do we build to more complex types? There are two basic building blocks from which we'll build more complex types out of primitive types.
</p>

<p>
The first is the union operation for types---<code>|</code> in <code>flow</code>. When we encounter this (as long as the types on either side are disjoint: <a href="https://flow.org/en/docs/types/unions/#toc-disjoint-unions">https://flow.org/en/docs/types/unions/#toc-disjoint-unions</a>), the total number of inhabitants is the sum of the number of inhabitants of the left hand type and the number of inhabitants of the right hand type. This is why union types are also sometimes called sum types. In symbols rather than words, where <code>τ</code> and <code>φ</code> are types and <code>σ(τ)</code> represents the cardinality of type <code>τ</code>:
</p>

<pre class="example">
σ(τ | φ) = σ(τ) + σ(φ)

We can start to convince ourselves it's true with examples like:

type boolean = true | false
σ(true) = 1 \text{(This is why types like these are called singleton types.)}
σ(false) = 1
σ(boolean) = σ(true | false) = σ(true) + σ(false) = 1 + 1

type ?boolean = boolean | null | void
σ(null) = 1
σ(void) = 1
σ(?boolean) = σ(boolean | null | void) = σ(boolean) + σ(null) + σ(void) = 2 + 1 + 1
</pre>

<div class="accordion">
<div class="accordion-head">
<p>
Practice
</p>

<p>
List out all the inhabitants of <code>?boolean</code>. Does it agree with our answer?
</p>

<p>
Derive the cardinality for <code>type CourseCompletionStateGood = 'Unstarted' | 'Started' | 'Complete'</code>.
</p>

</div>
<div class="accordion-body">
<div class="org-src-container">
<pre><code class="src src-js">type ?boolean = true | false | null | undefined;
σ(CourseCompletionStateGood) = σ('Unstarted') | σ('Started') | σ('Completed') = 1 + 1 + 1
</code></pre>
</div>

</div>

</div>

<p>
The other major building block for complex types is what we use when we build records and tuples (A tuple of <code>number</code> and <code>boolean</code> looks like <code>[number, boolean]</code> in <code>flow</code>.). In a tuple, the total number of inhabitants of the tuple is the product of the number of inhabitants of each side (hence, these are sometimes called product types). In symbols:
</p>

<pre class="example">
σ([τ, φ]) = σ(τ) · σ(φ)

We can start to convince ourselves it's true with examples like:

σ([Void, ?boolean])
  = σ(Void) · σ(?boolean)
  = 1 · 4
σ({ loggedIn: boolean, firstLogin: ?boolean })
  = σ({ loggedIn: boolean }) · σ({ firstLogin: ?boolean })
  = σ(boolean) · σ(?boolean)
  = 2 · 4
</pre>

<div class="accordion">
<div class="accordion-head">
<p>
Practice
</p>

<p>
List out all the inhabitants of <code>{ loggedIn: boolean, firstLogin: ?boolean }</code>. Does it agree with our answer?
</p>

</div>
<div class="accordion-body">
<div class="org-src-container">
<pre><code class="src src-js">type { loggedIn: boolean, firstLogin: ?boolean } =
  { loggedIn: true, firstLogin: true } |
  { loggedIn: true, firstLogin: false } |
  { loggedIn: true, firstLogin: null } |
  { loggedIn: true, firstLogin: undefined } |
  { loggedIn: false, firstLogin: true } |
  { loggedIn: false, firstLogin: false } |
  { loggedIn: false, firstLogin: null } |
  { loggedIn: false, firstLogin: undefined };
The 8 we see here agrees with our calculated answer.
</code></pre>
</div>

</div>

</div>

<p>
These two building blocks are enough to build enormously complex types&#x2014;lists, maps, enums, etc.
</p>

<p>
Our next step is to make the concept of illegal state a bit more precise. We can take either an operational or semantic perspective. The operational perspective says that an illegal state is one which is never occupied during any execution trace of the properly-functioning software. (This is less question-begging than it sounds because we define proper functioning of the software in terms of inputs and outputs while states can be purely internal.) The semantic perspective says that an illegal state is one which cannot be given a coherent meaning in the underlying domain that our software represents. In either case, we'll represent these valid states of <code>τ</code> as <code>{τ | β(τ)}</code> where <code>β</code> defines validity according to our business logic. (There's a notational collision here: <code>|</code> for union in <code>flow</code> and <code>|</code> for "such that" in set-builder notation. We can disambiguate by noting that set builder <code>|</code> is always and only enclosed by <code>{}</code> rather than <code>()</code>.)
</p>

<p>
With this machinery, we can rephrase. Instead of "make illegal state unrepresentable", we can say "use the business-logic-compatible type with minimum cardinality". Or equivalently for a fixed business logic, maximize <code>σ({τ | β(τ)}) / σ(τ)</code>. A value of <code>1</code> represents perfection with no illegal states remaining in the type.
</p>
</div>
</div>

<div id="outline-container-orged4132e" class="outline-2">
<h2 id="orged4132e"><span class="section-number-2">5</span> How</h2>
<div class="outline-text-2" id="text-5">
<p>
There are a variety of standard tricks for making illegal state unrepresentable that it will be useful to have in our bag.
</p>
</div>
