blog/misu.org
** Enums

We already saw one example of this with ~CourseCompletionState~. Here are others:

#+begin_src js
type CourseTrackBad = string;
const courseTrackBad: CourseTrackBad = 'Nonsense';
/* Instead: */
type CourseTrackGood = 'Honors' | 'Standard' | 'Audit';
// This won't typecheck:
// const courseTrackGood: CourseTrackGood = 'Nonsense';

type StarRatingBad = number;
const starRatingBad: StarRatingBad = -1.2;
/* Instead: */
type StarRatingGood = 1 | 2 | 3 | 4 | 5;
// This won't typecheck:
// const starRatingGood: StarRatingGood = -1.2;
#+end_src

The move here is to switch from a type like a string to a finite subset of that type which captures all the states we care about. This makes our intention clearer to the type checker and to readers.

#+begin_meta
Suppose we're convinced this technique is useful. It may still be difficult to put into practice because it's unfamiliar and we haven't yet built intuitions for when to use it. As a stepping stone on the way toward automaticity, this series will try to offer "action triggers" that prompt use of a technique. Through these we hope to transform the very hard (for the new initiate) task of "exercise your analytical abilities and judgment to find opportunities to apply any of a suite of techniques appropriately" to the simpler "remember these triggers and the corresponding technique for improvement". In the long term, this should build our capacity and familiarity and we'll eventually internalize these triggers and generate our own novel triggers and responses.
#+end_meta

#+begin_meta
Relatedly, I'll suggest using these techniques more often than is comfortable when first starting out. In fact, by following this guidance I hope that you /will/ use these techniques too often. Ultimately, for all these techniques, you'll want to settle on usage habits that make intelligent trade offs. But that judgement will be unrefined in the beginning and the only way to be gain confidence you've found the proper line is to cross it repeatedly./
#+end_meta

#+begin_trigger
Any time you ~switch~ or use nested ~if...else~ on a value whose type has infinitely many values (e.g. ~string~), there's a good chance you can make this change.
#+end_trigger

** Disjoint unions

I'll rely on [[https://flow.org/en/docs/types/unions/#toc-disjoint-unions][~flow~'s explanation]] for the basic technique here and leap right into some useful possibilities this technique offers.

#+begin_src js
/* If a user can login via one of several methods, we might try: */
type LoginIdBad = {
  emailAddress?: string,
  openIdSub?: string,
  openIdAud?: string,
};

/* But this permits invalid values like: */
const loginId1: LoginIdBad = {
  emailAddress: 'hal@enfield.edu',
  openIdSub: 'Hal',
};
const loginId2: LoginIdBad = {
};

/* We'd be better off with: */
type LoginIdGood
  = { tag: 'EmailAddress', value: string }
  | { tag: 'OpenId', sub: string, aud: string };

const loginId3: LoginIdGood = { tag: 'EmailAddress', value: 'hal@enfield.edu' };
/* Will produce a type error if we uncomment: */
// const loginId4: LoginIdGood = { tag: 'OpenId', value: 'hal@enfield.edu', openIdSub: 'Hal' };
#+end_src

The idea here is to make implicit cross-field correspondences explicit. In the original version, there was a hidden invariant that either ~emailAddress~ was absent and the other two fields were present or that ~emailAddress~ was present and the other two fields were absent. We can almost directly read off the previous sentence to explicitly encode these rules as a disjoint union.

Another short example:

#+begin_src js
/* Suppose one must qualify for a course by either testing into it or taking a prerequisite course: */
type CourseQualificationBad = {
  prereqGrade?: number,
  testGrade?: number,
};
/* But this permits invalid values like: */
const courseQualificationsBad = {
  prereqGrade: 1,
  testGrade: 1,
};
/* Instead: */
type Either<A, B> = { tag: 'Left', value: A } | { tag: 'Right', value: B };
type CourseQualificationGood = Either<{ prereqGrade: number }, { testGrade: number }>;
const courseQualificationsGood: CourseQualificationGood = { tag: 'Left', value: 1 };
#+end_src

This example has the same underlying logic as the previous example, but we declare a generic type ~Either~ that we can reuse over and over again in situations like this.

#+begin_trigger
Any time you see multiple nullable fields in a record, you should ask yourself, "Is it really true that every combination of null and non-null across these fields is valid?".
#+end_trigger

