blog/misu.html

<div id="outline-container-org938b8b7" class="outline-3">
<h3 id="org938b8b7"><span class="section-number-3">5.1</span> Enums</h3>
<div class="outline-text-3" id="text-5-1">
<p>
We already saw one example of this with <code>CourseCompletionState</code>. Here are others:
</p>

<div class="org-src-container">
<pre><code class="src src-js">type CourseTrackBad = string;
const courseTrackBad: CourseTrackBad = 'Nonsense';
/* Instead: */
type CourseTrackGood = 'Honors' | 'Standard' | 'Audit';
// This won't typecheck:
// const courseTrackGood: CourseTrackGood = 'Nonsense';

type StarRatingBad = number;
const starRatingBad: StarRatingBad = -1.2;
/* Instead: */
type StarRatingGood = 1 | 2 | 3 | 4 | 5;
// This won't typecheck:
// const starRatingGood: StarRatingGood = -1.2;
</code></pre>
</div>

<p>
The move here is to switch from a type like a string to a finite subset of that type which captures all the states we care about. This makes our intention clearer to the type checker and to readers.
</p>

<div class="meta">
<p>
Suppose we're convinced this technique is useful. It may still be difficult to put into practice because it's unfamiliar and we haven't yet built intuitions for when to use it. As a stepping stone on the way toward automaticity, this series will try to offer "action triggers" that prompt use of a technique. Through these we hope to transform the very hard (for the new initiate) task of "exercise your analytical abilities and judgment to find opportunities to apply any of a suite of techniques appropriately" to the simpler "remember these triggers and the corresponding technique for improvement". In the long term, this should build our capacity and familiarity and we'll eventually internalize these triggers and generate our own novel triggers and responses.
</p>

</div>

<div class="meta">
<p>
Relatedly, I'll suggest using these techniques more often than is comfortable when first starting out. In fact, by following this guidance I hope that you <i>will</i> use these techniques too often. Ultimately, for all these techniques, you'll want to settle on usage habits that make intelligent trade offs. But that judgement will be unrefined in the beginning and the only way to be gain confidence you've found the proper line is to cross it repeatedly./
</p>

</div>

<div class="trigger">
<p>
Any time you <code>switch</code> or use nested <code>if...else</code> on a value whose type has infinitely many values (e.g. <code>string</code>), there's a good chance you can make this change.
</p>

</div>
</div>
</div>

<div id="outline-container-orgee63b64" class="outline-3">
<h3 id="orgee63b64"><span class="section-number-3">5.2</span> Disjoint unions</h3>
<div class="outline-text-3" id="text-5-2">
<p>
I'll rely on <a href="https://flow.org/en/docs/types/unions/#toc-disjoint-unions"><code>flow</code>'s explanation</a> for the basic technique here and leap right into some useful possibilities this technique offers.
</p>

<div class="org-src-container">
<pre><code class="src src-js">/* If a user can login via one of several methods, we might try: */
type LoginIdBad = {
  emailAddress?: string,
  openIdSub?: string,
  openIdAud?: string,
};

/* But this permits invalid values like: */
const loginId1: LoginIdBad = {
  emailAddress: 'hal@enfield.edu',
  openIdSub: 'Hal',
};
const loginId2: LoginIdBad = {
};

/* We'd be better off with: */
type LoginIdGood
  = { tag: 'EmailAddress', value: string }
  | { tag: 'OpenId', sub: string, aud: string };

const loginId3: LoginIdGood = { tag: 'EmailAddress', value: 'hal@enfield.edu' };
/* Will produce a type error if we uncomment: */
// const loginId4: LoginIdGood = { tag: 'OpenId', value: 'hal@enfield.edu', openIdSub: 'Hal' };
</code></pre>
</div>

<p>
The idea here is to make implicit cross-field correspondences explicit. In the original version, there was a hidden invariant that either <code>emailAddress</code> was absent and the other two fields were present or that <code>emailAddress</code> was present and the other two fields were absent. We can almost directly read off the previous sentence to explicitly encode these rules as a disjoint union.
</p>

<p>
Another short example:
</p>

<div class="org-src-container">
<pre><code class="src src-js">/* Suppose one must qualify for a course by either testing into it or taking a prerequisite course: */
type CourseQualificationBad = {
  prereqGrade?: number,
  testGrade?: number,
};
/* But this permits invalid values like: */
const courseQualificationsBad = {
  prereqGrade: 1,
  testGrade: 1,
};
/* Instead: */
type Either&lt;A, B&gt; = { tag: 'Left', value: A } | { tag: 'Right', value: B };
type CourseQualificationGood = Either&lt;{ prereqGrade: number }, { testGrade: number }&gt;;
const courseQualificationsGood: CourseQualificationGood = { tag: 'Left', value: 1 };
</code></pre>
</div>

<p>
This example has the same underlying logic as the previous example, but we declare a generic type <code>Either</code> that we can reuse over and over again in situations like this.
</p>

<div class="trigger">
<p>
Any time you see multiple nullable fields in a record, you should ask yourself, "Is it really true that every combination of null and non-null across these fields is valid?".
</p>

</div>
</div>
</div>
