blog/misu.org
** Refined types

#+begin_src js
/* We might start with something like this: */
type PersonBad = {
  name: string,
  age: number,
};
/* But this permits invalid values like: */
const personBad: PersonBad = {
  name: 'Hal Incandenza',
  age: -1,
};
/* Instead: */
class PositiveNumber {
  raw: number;
  constructor(num: number): PositiveNumber {
    if (num >= 0) {
      this.raw = num;
      return this;
    } else {
      throw new TypeError('Number not positive');
    }
  }
  static make(num: number): ?PositiveNumber {
    try {
      return new PositiveNumber(num);
    } catch (e) {
      if (e instanceof TypeError) {
        return null;
      } else {
        throw e;
      }
    }
  }
}
type PersonGood = {
  name: string,
  age: PositiveNumber,
};
const personGood: PersonGood = {
  name: 'Hal Incandenza',
  age: new PositiveNumber(17),
};
#+end_src

Here, we'd like to restrict a type to some subset of its inhabitants. But the subset in infinite so we can't just use the enum technique outlined earlier. Instead, we create a class whose only constructor performs the check for us at runtime. Now, our class acts as a witness for the property we care about. The only way to get ~PositiveNumber~ is by passing the ~num >= 0~ check in the constructor so we can be confident that every ~PositiveNumber~ is greater than or equal to zero.

#+begin_accordion
#+begin_accordion-head
Practice

To convince yourself this technique works, try to construct a ~PositiveNumber~ that's less than 0. Absent dirty tricks, you should fail.
#+end_accordion-head
#+end_accordion

Another example:

#+begin_src js
/* Suppose we want to track the history of IP addresses we've seen for a user: */
type ScaryTrackingDataBad = {
  knownIpAddresses: Array<string>,
};
/* But if we note the user's IP address on first page load, `knownIpAddresses` should never be empty. So instead: */
class NonEmptyArray<A> {
  raw: Array<A>;
  constructor(array: Array<A>): NonEmptyArray<A> {
    if (array.length !== 0) {
      this.raw = array;
      return this;
    } else {
      throw new TypeError('Array is empty');
    }
  }
  static make(array: Array<A>): ?NonEmptyArray<A> {
    try {
      return new NonEmptyArray(array);
    } catch (e) {
      if (e instanceof TypeError) {
        return null;
      } else {
        throw e;
      }
    }
  }
}
type ScaryTrackingDataBad = {
  knownIpAddresses: NonEmptyArray<string>,
};
#+end_src

This non-empty array type turns out to be quite broadly useful because many array operations assume there's at least one element---~pop()~, ~reduce()~ without an initial value, etc. Over time, we'll build up a utility library of useful types like this that we can reuse again and again.

#+begin_trigger
It's hard to create an action trigger here because this technique will almost always be available and it'll be a matter of discretion when and to what extent you use it. Perhaps the best we can do to make this mechanical is commit a library of standard refined types to memory and be on the lookout for opportunities to use them.
#+end_trigger

* Why

We'll argue in a couple modes: intuitive appeals about code quality and attempts to ground ourselves in cognitive science.

** Code quality

I'll claim three benefits:

1. It should be uncontroversial that this approach necessarily rules out at least some defects---those arising from illegal states that we've made unrepresentable.
2. This approach tends to improve the readability of our code. By encoding more invariants in the type system, we move knowledge from the private world of the implementer's mental model into a shared, manifest form---code. We no longer have to trust that our inheritors---or even ourselves at some later date!---will notice that a learner /must/ qualify for a course via a test or prerequisite course. 
3. If we follow this policy comprehensively, it tends to push validations to the "outer shell" of the program. Because invalid inhabitants aren't even possible, we can't defer validations. Validating on our first receipt of data has the useful effect of clarifying all the central business logic since it has to deal with fewer invalidities and edge cases.

** Cognitive science

Humans are bad at understanding sets and their inhabitants. The availability heuristic suggests that we let our thoughts be dominated by immediate and prominent inhabitants of a category. Said another way, our default mode is to forget edge cases. An unstructured attempt to manage this deficiency relies upon prospective memory (When we tell ourselves to purchase an item the next time we go to the grocery store, we are attempting to leverage prospective memory.). That is, when we leave invalid states representable, we are implicitly asking our future selves to remember to appropriately handle these states at every use site. Research demonstrates that our prospective memory is notably imperfect with a failure rate in the tens of percents. Furthermore, research shows that the demands we place on prospective memory aren't free. They diminish our available supply of cognitive resources by affecting things like working memory.

The type system approach to making illegal state unrepresentable I outlined here doesn't directly compensate for the availability heuristic (However, the action triggers and habits we talked about may help us get better at noticing these sorts of problems.). But it does ensure that any invalid states we discover need only be discovered once. Thereafter, these discoveries can be encoded in the type system, checked without fail, and forgotten, thereby freeing our cognitive resources for other tasks.

* Summary

I advocated for the slogan "make illegal state unrepresentable". This is about choosing types that, ideally, allow us to express only our business logic and nothing else. Pervasive use of enums, disjoint unions and refined types moves us toward this ideal. In addition to reducing defects, this can make our code more readable.
