blog/misu.html

<div id="outline-container-org667cf01" class="outline-3">
<h3 id="org667cf01"><span class="section-number-3">5.3</span> Refined types</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre><code class="src src-js">/* We might start with something like this: */
type PersonBad = {
  name: string,
  age: number,
};
/* But this permits invalid values like: */
const personBad: PersonBad = {
  name: 'Hal Incandenza',
  age: -1,
};
/* Instead: */
class PositiveNumber {
  raw: number;
  constructor(num: number): PositiveNumber {
    if (num &gt;= 0) {
      this.raw = num;
      return this;
    } else {
      throw new TypeError('Number not positive');
    }
  }
  static make(num: number): ?PositiveNumber {
    try {
      return new PositiveNumber(num);
    } catch (e) {
      if (e instanceof TypeError) {
        return null;
      } else {
        throw e;
      }
    }
  }
}
type PersonGood = {
  name: string,
  age: PositiveNumber,
};
const personGood: PersonGood = {
  name: 'Hal Incandenza',
  age: new PositiveNumber(17),
};
</code></pre>
</div>

<p>
Here, we'd like to restrict a type to some subset of its inhabitants. But the subset in infinite so we can't just use the enum technique outlined earlier. Instead, we create a class whose only constructor performs the check for us at runtime. Now, our class acts as a witness for the property we care about. The only way to get <code>PositiveNumber</code> is by passing the <code>num &gt;= 0</code> check in the constructor so we can be confident that every <code>PositiveNumber</code> is greater than or equal to zero.
</p>

<div class="accordion">
<div class="accordion-head">
<p>
Practice
</p>

<p>
To convince yourself this technique works, try to construct a <code>PositiveNumber</code> that's less than 0. Absent dirty tricks, you should fail.
</p>

</div>

</div>

<p>
Another example:
</p>

<div class="org-src-container">
<pre><code class="src src-js">/* Suppose we want to track the history of IP addresses we've seen for a user: */
type ScaryTrackingDataBad = {
  knownIpAddresses: Array&lt;string&gt;,
};
/* But if we note the user's IP address on first page load, `knownIpAddresses` should never be empty. So instead: */
class NonEmptyArray&lt;A&gt; {
  raw: Array&lt;A&gt;;
  constructor(array: Array&lt;A&gt;): NonEmptyArray&lt;A&gt; {
    if (array.length !== 0) {
      this.raw = array;
      return this;
    } else {
      throw new TypeError('Array is empty');
    }
  }
  static make(array: Array&lt;A&gt;): ?NonEmptyArray&lt;A&gt; {
    try {
      return new NonEmptyArray(array);
    } catch (e) {
      if (e instanceof TypeError) {
        return null;
      } else {
        throw e;
      }
    }
  }
}
type ScaryTrackingDataBad = {
  knownIpAddresses: NonEmptyArray&lt;string&gt;,
};
</code></pre>
</div>

<p>
This non-empty array type turns out to be quite broadly useful because many array operations assume there's at least one element---<code>pop()</code>, <code>reduce()</code> without an initial value, etc. Over time, we'll build up a utility library of useful types like this that we can reuse again and again.
</p>

<div class="trigger">
<p>
It's hard to create an action trigger here because this technique will almost always be available and it'll be a matter of discretion when and to what extent you use it. Perhaps the best we can do to make this mechanical is commit a library of standard refined types to memory and be on the lookout for opportunities to use them.
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-orgc002741" class="outline-2">
<h2 id="orgc002741"><span class="section-number-2">6</span> Why</h2>
<div class="outline-text-2" id="text-6">
<p>
We'll argue in a couple modes: intuitive appeals about code quality and attempts to ground ourselves in cognitive science.
</p>
</div>

<div id="outline-container-org3e6e993" class="outline-3">
<h3 id="org3e6e993"><span class="section-number-3">6.1</span> Code quality</h3>
<div class="outline-text-3" id="text-6-1">
<p>
I'll claim three benefits:
</p>

<ol class="org-ol">
<li>It should be uncontroversial that this approach necessarily rules out at least some defects&#x2014;those arising from illegal states that we've made unrepresentable.</li>
<li>This approach tends to improve the readability of our code. By encoding more invariants in the type system, we move knowledge from the private world of the implementer's mental model into a shared, manifest form&#x2014;code. We no longer have to trust that our inheritors&#x2014;or even ourselves at some later date!&#x2014;will notice that a learner <i>must</i> qualify for a course via a test or prerequisite course.</li>
<li>If we follow this policy comprehensively, it tends to push validations to the "outer shell" of the program. Because invalid inhabitants aren't even possible, we can't defer validations. Validating on our first receipt of data has the useful effect of clarifying all the central business logic since it has to deal with fewer invalidities and edge cases.</li>
</ol>
</div>
</div>

<div id="outline-container-org45cc70d" class="outline-3">
<h3 id="org45cc70d"><span class="section-number-3">6.2</span> Cognitive science</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Humans are bad at understanding sets and their inhabitants. The availability heuristic suggests that we let our thoughts be dominated by immediate and prominent inhabitants of a category. Said another way, our default mode is to forget edge cases. An unstructured attempt to manage this deficiency relies upon prospective memory (When we tell ourselves to purchase an item the next time we go to the grocery store, we are attempting to leverage prospective memory.). That is, when we leave invalid states representable, we are implicitly asking our future selves to remember to appropriately handle these states at every use site. Research demonstrates that our prospective memory is notably imperfect with a failure rate in the tens of percents. Furthermore, research shows that the demands we place on prospective memory aren't free. They diminish our available supply of cognitive resources by affecting things like working memory.
</p>

<p>
The type system approach to making illegal state unrepresentable I outlined here doesn't directly compensate for the availability heuristic (However, the action triggers and habits we talked about may help us get better at noticing these sorts of problems.). But it does ensure that any invalid states we discover need only be discovered once. Thereafter, these discoveries can be encoded in the type system, checked without fail, and forgotten, thereby freeing our cognitive resources for other tasks.
</p>
</div>
</div>
</div>

<div id="outline-container-orgaad6419" class="outline-2">
<h2 id="orgaad6419"><span class="section-number-2">7</span> Summary</h2>
<div class="outline-text-2" id="text-7">
<p>
I advocated for the slogan "make illegal state unrepresentable". This is about choosing types that, ideally, allow us to express only our business logic and nothing else. Pervasive use of enums, disjoint unions and refined types moves us toward this ideal. In addition to reducing defects, this can make our code more readable.
</p>
</div>
</div>
</div>
</body>
</html>
